Yes I deleted it. I did a test how Kube-Hetzner performs if a node dies (what could happen in real world)

I am on git master branch (I didn't recognize, that there is a k3os branch)

```
servers_num               = 3
agents_num                = 3

```

running `terraform plan` and `terraform apply --auto-approve`

```

❯ tf apply --auto-approve
local_file.traefik_config: Refreshing state... [id=25ba84696ee16d68f5b98f6ea6b70bb14c3c530c]
hcloud_ssh_key.default: Refreshing state... [id=5492430]
hcloud_placement_group.k3s_placement_group: Refreshing state... [id=19653]
hcloud_network.k3s: Refreshing state... [id=1352333]
random_password.k3s_token: Refreshing state... [id=none]
hcloud_firewall.k3s: Refreshing state... [id=290151]
local_file.hetzner_ccm_config: Refreshing state... [id=f5ec6cb5689cb5830d04857365d567edae562174]
local_file.hetzner_csi_config: Refreshing state... [id=aa232912bcf86722e32b698e1e077522c7f02a9d]
hcloud_network_subnet.k3s: Refreshing state... [id=1352333-10.0.0.0/16]
hcloud_server.first_control_plane: Refreshing state... [id=17736249]
hcloud_server.agents[0]: Refreshing state... [id=17736379]
hcloud_server.agents[1]: Refreshing state... [id=17736385]
hcloud_server.agents[2]: Refreshing state... [id=17736383]
hcloud_server.control_planes[1]: Refreshing state... [id=17736378]
hcloud_server.control_planes[0]: Refreshing state... [id=17736377]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are
needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

Outputs:

agents_public_ip = [
  "142.132.184.xxx",
  "138.201.116.xxx",
  "138.201.246.xxx",
]
controlplanes_public_ip = [
  "49.12.221.xxx",
  "78.46.165.xxx",
  "78.47.101.xxx",
]

```

<img width="253" alt="Bildschirmfoto 2022-02-11 um 10 34 29" src="https://user-images.githubusercontent.com/1597621/153568303-3ac39d16-89be-4ce9-9846-768e12cac0e1.png">

```

❯ hcloud server list
ID         NAME                  STATUS    IPV4              IPV6                      DATACENTER
17736249   k3s-control-plane-0   running   49.12.221.xxx    2a01:4f8:1c17:xxx::/64   fsn1-dc14
17736377   k3s-control-plane-1   running   78.46.165.xxx     2a01:4f8:1c17:4xx4::/64   fsn1-dc14
17736378   k3s-control-plane-2   running   78.47.101.xxx     2a01:4f8:1c17:xxxx::/64   fsn1-dc14
17736379   k3s-agent-0           running   142.132.184.xxx    2a01:4f8:1c17:xxxx::/64   fsn1-dc14
17736383   k3s-agent-2           running   138.201.246.xxx   2a01:4f8:1c17:f7b6::/64   fsn1-dc14
17736385   k3s-agent-1           running   138.201.116.xxx   2a01:4f8:1c17:xxx::/64   fsn1-dc14
```

Start scale up:

```
servers_num               = 3
agents_num                = 6
```

`tf apply --auto-approve`

```
❯ terraform apply -auto-approve
hcloud_network.k3s: Refreshing state... [id=1352333]
hcloud_ssh_key.default: Refreshing state... [id=5492430]
hcloud_placement_group.k3s_placement_group: Refreshing state... [id=19653]
local_file.traefik_config: Refreshing state... [id=25ba84696ee16d68f5b98f6ea6b70bb14c3c530c]
random_password.k3s_token: Refreshing state... [id=none]
hcloud_firewall.k3s: Refreshing state... [id=290151]
local_file.hetzner_ccm_config: Refreshing state... [id=f5ec6cb5689cb5830d04857365d567edae562174]
hcloud_network_subnet.k3s: Refreshing state... [id=1352333-10.0.0.0/16]
local_file.hetzner_csi_config: Refreshing state... [id=aa232912bcf86722e32b698e1e077522c7f02a9d]
hcloud_server.first_control_plane: Refreshing state... [id=17736249]
hcloud_server.agents[0]: Refreshing state... [id=17736379]
hcloud_server.control_planes[0]: Refreshing state... [id=17736377]
hcloud_server.agents[2]: Refreshing state... [id=17736383]
hcloud_server.agents[1]: Refreshing state... [id=17736385]
hcloud_server.control_planes[1]: Refreshing state... [id=17736378]
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create

Terraform will perform the following actions:
```
  # hcloud_server.agents[3] will be created
  + resource "hcloud_server" "agents" {
      + backup_window      = (known after apply)
      + backups            = false
      + datacenter         = (known after apply)
      + delete_protection  = false
      + firewall_ids       = [
          + 290151,
        ]
      + id                 = (known after apply)
      + image              = "ubuntu-20.04"
      + ipv4_address       = (known after apply)
      + ipv6_address       = (known after apply)
      + ipv6_network       = (known after apply)
      + keep_disk          = false
      + labels             = {
          + "engine"      = "k3s"
          + "k3s_upgrade" = "true"
          + "provisioner" = "terraform"
        }
      + location           = "fsn1"
      + name               = "k3s-agent-3"
      + placement_group_id = 19653
      + rebuild_protection = false
      + rescue             = "linux64"
      + server_type        = "cpx21"
      + ssh_keys           = [
          + "5492430",
        ]
      + status             = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.8"
          + mac_address = (known after apply)
          + network_id  = 1352333
        }
    }

  # hcloud_server.agents[4] will be created
  + resource "hcloud_server" "agents" {
      + backup_window      = (known after apply)
      + backups            = false
      + datacenter         = (known after apply)
      + delete_protection  = false
      + firewall_ids       = [
          + 290151,
        ]
      + id                 = (known after apply)
      + image              = "ubuntu-20.04"
      + ipv4_address       = (known after apply)
      + ipv6_address       = (known after apply)
      + ipv6_network       = (known after apply)
      + keep_disk          = false
      + labels             = {
          + "engine"      = "k3s"
          + "k3s_upgrade" = "true"
          + "provisioner" = "terraform"
        }
      + location           = "fsn1"
      + name               = "k3s-agent-4"
      + placement_group_id = 19653
      + rebuild_protection = false
      + rescue             = "linux64"
      + server_type        = "cpx21"
      + ssh_keys           = [
          + "5492430",
        ]
      + status             = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.9"
          + mac_address = (known after apply)
          + network_id  = 1352333
        }
    }

  # hcloud_server.agents[5] will be created
  + resource "hcloud_server" "agents" {
      + backup_window      = (known after apply)
      + backups            = false
      + datacenter         = (known after apply)
      + delete_protection  = false
      + firewall_ids       = [
          + 290151,
        ]
      + id                 = (known after apply)
      + image              = "ubuntu-20.04"
      + ipv4_address       = (known after apply)
      + ipv6_address       = (known after apply)
      + ipv6_network       = (known after apply)
      + keep_disk          = false
      + labels             = {
          + "engine"      = "k3s"
          + "k3s_upgrade" = "true"
          + "provisioner" = "terraform"
        }
      + location           = "fsn1"
      + name               = "k3s-agent-5"
      + placement_group_id = 19653
      + rebuild_protection = false
      + rescue             = "linux64"
      + server_type        = "cpx21"
      + ssh_keys           = [
          + "5492430",
        ]
      + status             = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.10"
          + mac_address = (known after apply)
          + network_id  = 1352333
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ agents_public_ip = [
        # (2 unchanged elements hidden)
        "138.201.246.186",
      + (known after apply),
      + (known after apply),
      + (known after apply),
]
hcloud_server.agents[4]: Creating...
hcloud_server.agents[5]: Creating...
hcloud_server.agents[3]: Creating...
hcloud_server.agents[4]: Still creating... [10s elapsed]
hcloud_server.agents[3]: Still creating... [10s elapsed]
hcloud_server.agents[5]: Still creating... [10s elapsed]
hcloud_server.agents[4]: Provisioning with 'file'...
hcloud_server.agents[5]: Provisioning with 'file'...
hcloud_server.agents[5]: Still creating... [20s elapsed]
hcloud_server.agents[4]: Still creating... [20s elapsed]
hcloud_server.agents[5]: Still creating... [30s elapsed]
hcloud_server.agents[4]: Still creating... [30s elapsed]

```

<img width="554" alt="Bildschirmfoto 2022-02-11 um 10 55 16" src="https://user-images.githubusercontent.com/1597621/153571136-0717e9b0-b5b6-4f53-96ac-73d58c00e754.png">

<img width="254" alt="Bildschirmfoto 2022-02-11 um 10 52 21" src="https://user-images.githubusercontent.com/1597621/153571148-bb4550d0-156f-4a27-bc68-cedb0854ff8c.png">

again, like in my latest post, tf is installing agents on all agents except "agent-3".
Somewhere in the provisioning process, terraform or k3os must know which agents exists. I may have to delete thet "orphaned" entry. This is the reason I created an issue at k3os, may the problem relies on k3os?

(symbol photo)
<img width="1559" alt="Bildschirmfoto 2022-02-10 um 23 04 25" src="https://user-images.githubusercontent.com/1597621/153571178-0d94496e-cd39-48e2-97db-ad03c8a0a08f.png">



